use super::*;
use crate::stg::types::{StgInt, StgPtr, StgWord, StgWord64};
use crate::utils::test::*;
#[cfg(feature = "sys")]
use ghc_rts_sys as sys;
use quickcheck_macros::quickcheck;
use std::ffi::{c_char, c_int, c_uint, c_void};
use std::mem::transmute;
use std::ptr::{null, null_mut};
#[cfg(feature = "sys")]
#[test]
fn sys_size_PauseToken_() {
    assert_eq!(size_of::<sys::PauseToken_>(), size_of::<PauseToken_>())
}

#[cfg(feature = "sys")]
#[quickcheck]
fn equivalent_pauseTokenCapability(pauseToken: PauseToken) -> bool {
    let expected = unsafe { transmute(sys::pauseTokenCapability(&mut pauseToken.into())) };
    let actual = unsafe { pauseTokenCapability(&mut pauseToken) };
    actual == expected
}

#[test]
#[ignore]
fn test_pauseTokenCapability() {
    let mut pauseToken = null_mut();
    unsafe { pauseTokenCapability(&mut pauseToken) };
    todo!("assert")
}

#[cfg(feature = "sys")]
#[test]
fn sys_size_CapabilityPublic_() {
    assert_eq!(
        size_of::<sys::CapabilityPublic_>(),
        size_of::<CapabilityPublic_>()
    )
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CapabilityPublic_"][size_of::<CapabilityPublic_>() - 944usize];
    ["Alignment of CapabilityPublic_"][align_of::<CapabilityPublic_>() - 8usize];
    ["Offset of field: CapabilityPublic_::f"][offset_of!(CapabilityPublic_, f) - 0usize];
    ["Offset of field: CapabilityPublic_::r"][offset_of!(CapabilityPublic_, r) - 24usize];
};

#[cfg(feature = "sys")]
#[test]
fn sys_size_RtsConfig() {
    assert_eq!(size_of::<sys::RtsConfig>(), size_of::<RtsConfig>())
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RtsConfig"][size_of::<RtsConfig>() - 112usize];
    ["Alignment of RtsConfig"][align_of::<RtsConfig>() - 8usize];
    ["Offset of field: RtsConfig::rts_opts_enabled"]
        [offset_of!(RtsConfig, rts_opts_enabled) - 0usize];
    ["Offset of field: RtsConfig::rts_opts_suggestions"]
        [offset_of!(RtsConfig, rts_opts_suggestions) - 8usize];
    ["Offset of field: RtsConfig::rts_opts"][offset_of!(RtsConfig, rts_opts) - 16usize];
    ["Offset of field: RtsConfig::rts_hs_main"][offset_of!(RtsConfig, rts_hs_main) - 24usize];
    ["Offset of field: RtsConfig::keep_cafs"][offset_of!(RtsConfig, keep_cafs) - 32usize];
    ["Offset of field: RtsConfig::eventlog_writer"]
        [offset_of!(RtsConfig, eventlog_writer) - 40usize];
    ["Offset of field: RtsConfig::defaultsHook"][offset_of!(RtsConfig, defaultsHook) - 48usize];
    ["Offset of field: RtsConfig::onExitHook"][offset_of!(RtsConfig, onExitHook) - 56usize];
    ["Offset of field: RtsConfig::stackOverflowHook"]
        [offset_of!(RtsConfig, stackOverflowHook) - 64usize];
    ["Offset of field: RtsConfig::outOfHeapHook"][offset_of!(RtsConfig, outOfHeapHook) - 72usize];
    ["Offset of field: RtsConfig::mallocFailHook"][offset_of!(RtsConfig, mallocFailHook) - 80usize];
    ["Offset of field: RtsConfig::gcDoneHook"][offset_of!(RtsConfig, gcDoneHook) - 88usize];
    ["Offset of field: RtsConfig::longGCSync"][offset_of!(RtsConfig, longGCSync) - 96usize];
    ["Offset of field: RtsConfig::longGCSyncEnd"][offset_of!(RtsConfig, longGCSyncEnd) - 104usize];
};

#[cfg(feature = "sys")]
#[test]
fn sys_size_GCDetails_() {
    assert_eq!(size_of::<sys::GCDetails_>(), size_of::<GCDetails_>())
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GCDetails_"][size_of::<GCDetails_>() - 144usize];
    ["Alignment of GCDetails_"][align_of::<GCDetails_>() - 8usize];
    ["Offset of field: GCDetails_::gen_"][offset_of!(GCDetails_, gen_) - 0usize];
    ["Offset of field: GCDetails_::threads"][offset_of!(GCDetails_, threads) - 4usize];
    ["Offset of field: GCDetails_::allocated_bytes"]
        [offset_of!(GCDetails_, allocated_bytes) - 8usize];
    ["Offset of field: GCDetails_::live_bytes"][offset_of!(GCDetails_, live_bytes) - 16usize];
    ["Offset of field: GCDetails_::large_objects_bytes"]
        [offset_of!(GCDetails_, large_objects_bytes) - 24usize];
    ["Offset of field: GCDetails_::compact_bytes"][offset_of!(GCDetails_, compact_bytes) - 32usize];
    ["Offset of field: GCDetails_::slop_bytes"][offset_of!(GCDetails_, slop_bytes) - 40usize];
    ["Offset of field: GCDetails_::mem_in_use_bytes"]
        [offset_of!(GCDetails_, mem_in_use_bytes) - 48usize];
    ["Offset of field: GCDetails_::copied_bytes"][offset_of!(GCDetails_, copied_bytes) - 56usize];
    ["Offset of field: GCDetails_::block_fragmentation_bytes"]
        [offset_of!(GCDetails_, block_fragmentation_bytes) - 64usize];
    ["Offset of field: GCDetails_::par_max_copied_bytes"]
        [offset_of!(GCDetails_, par_max_copied_bytes) - 72usize];
    ["Offset of field: GCDetails_::par_balanced_copied_bytes"]
        [offset_of!(GCDetails_, par_balanced_copied_bytes) - 80usize];
    ["Offset of field: GCDetails_::sync_elapsed_ns"]
        [offset_of!(GCDetails_, sync_elapsed_ns) - 88usize];
    ["Offset of field: GCDetails_::cpu_ns"][offset_of!(GCDetails_, cpu_ns) - 96usize];
    ["Offset of field: GCDetails_::elapsed_ns"][offset_of!(GCDetails_, elapsed_ns) - 104usize];
    ["Offset of field: GCDetails_::nonmoving_gc_sync_cpu_ns"]
        [offset_of!(GCDetails_, nonmoving_gc_sync_cpu_ns) - 112usize];
    ["Offset of field: GCDetails_::nonmoving_gc_sync_elapsed_ns"]
        [offset_of!(GCDetails_, nonmoving_gc_sync_elapsed_ns) - 120usize];
    ["Offset of field: GCDetails_::nonmoving_gc_cpu_ns"]
        [offset_of!(GCDetails_, nonmoving_gc_cpu_ns) - 128usize];
    ["Offset of field: GCDetails_::nonmoving_gc_elapsed_ns"]
        [offset_of!(GCDetails_, nonmoving_gc_elapsed_ns) - 136usize];
};

#[cfg(feature = "sys")]
#[test]
fn sys_size__RTSStats() {
    assert_eq!(size_of::<sys::_RTSStats>(), size_of::<_RTSStats>())
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RTSStats"][size_of::<_RTSStats>() - 376usize];
    ["Alignment of _RTSStats"][align_of::<_RTSStats>() - 8usize];
    ["Offset of field: _RTSStats::gcs"][offset_of!(_RTSStats, gcs) - 0usize];
    ["Offset of field: _RTSStats::major_gcs"][offset_of!(_RTSStats, major_gcs) - 4usize];
    ["Offset of field: _RTSStats::allocated_bytes"]
        [offset_of!(_RTSStats, allocated_bytes) - 8usize];
    ["Offset of field: _RTSStats::max_live_bytes"][offset_of!(_RTSStats, max_live_bytes) - 16usize];
    ["Offset of field: _RTSStats::max_large_objects_bytes"]
        [offset_of!(_RTSStats, max_large_objects_bytes) - 24usize];
    ["Offset of field: _RTSStats::max_compact_bytes"]
        [offset_of!(_RTSStats, max_compact_bytes) - 32usize];
    ["Offset of field: _RTSStats::max_slop_bytes"][offset_of!(_RTSStats, max_slop_bytes) - 40usize];
    ["Offset of field: _RTSStats::max_mem_in_use_bytes"]
        [offset_of!(_RTSStats, max_mem_in_use_bytes) - 48usize];
    ["Offset of field: _RTSStats::cumulative_live_bytes"]
        [offset_of!(_RTSStats, cumulative_live_bytes) - 56usize];
    ["Offset of field: _RTSStats::copied_bytes"][offset_of!(_RTSStats, copied_bytes) - 64usize];
    ["Offset of field: _RTSStats::par_copied_bytes"]
        [offset_of!(_RTSStats, par_copied_bytes) - 72usize];
    ["Offset of field: _RTSStats::cumulative_par_max_copied_bytes"]
        [offset_of!(_RTSStats, cumulative_par_max_copied_bytes) - 80usize];
    ["Offset of field: _RTSStats::cumulative_par_balanced_copied_bytes"]
        [offset_of!(_RTSStats, cumulative_par_balanced_copied_bytes) - 88usize];
    ["Offset of field: _RTSStats::init_cpu_ns"][offset_of!(_RTSStats, init_cpu_ns) - 96usize];
    ["Offset of field: _RTSStats::init_elapsed_ns"]
        [offset_of!(_RTSStats, init_elapsed_ns) - 104usize];
    ["Offset of field: _RTSStats::mutator_cpu_ns"]
        [offset_of!(_RTSStats, mutator_cpu_ns) - 112usize];
    ["Offset of field: _RTSStats::mutator_elapsed_ns"]
        [offset_of!(_RTSStats, mutator_elapsed_ns) - 120usize];
    ["Offset of field: _RTSStats::gc_cpu_ns"][offset_of!(_RTSStats, gc_cpu_ns) - 128usize];
    ["Offset of field: _RTSStats::gc_elapsed_ns"][offset_of!(_RTSStats, gc_elapsed_ns) - 136usize];
    ["Offset of field: _RTSStats::cpu_ns"][offset_of!(_RTSStats, cpu_ns) - 144usize];
    ["Offset of field: _RTSStats::elapsed_ns"][offset_of!(_RTSStats, elapsed_ns) - 152usize];
    ["Offset of field: _RTSStats::gc"][offset_of!(_RTSStats, gc) - 160usize];
    ["Offset of field: _RTSStats::any_work"][offset_of!(_RTSStats, any_work) - 304usize];
    ["Offset of field: _RTSStats::scav_find_work"]
        [offset_of!(_RTSStats, scav_find_work) - 312usize];
    ["Offset of field: _RTSStats::max_n_todo_overflow"]
        [offset_of!(_RTSStats, max_n_todo_overflow) - 320usize];
    ["Offset of field: _RTSStats::nonmoving_gc_sync_cpu_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_sync_cpu_ns) - 328usize];
    ["Offset of field: _RTSStats::nonmoving_gc_sync_elapsed_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_sync_elapsed_ns) - 336usize];
    ["Offset of field: _RTSStats::nonmoving_gc_sync_max_elapsed_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_sync_max_elapsed_ns) - 344usize];
    ["Offset of field: _RTSStats::nonmoving_gc_cpu_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_cpu_ns) - 352usize];
    ["Offset of field: _RTSStats::nonmoving_gc_elapsed_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_elapsed_ns) - 360usize];
    ["Offset of field: _RTSStats::nonmoving_gc_max_elapsed_ns"]
        [offset_of!(_RTSStats, nonmoving_gc_max_elapsed_ns) - 368usize];
};

#[test]
#[ignore]
fn test_getRTSStats() {
    let mut s = null_mut();
    unsafe { getRTSStats(&mut s) };
    todo!("assert")
}

#[cfg(feature = "sys")]
#[quickcheck]
fn equivalent_getRTSStatsEnabled() -> bool {
    let expected = unsafe { sys::getRTSStatsEnabled() };
    let actual = unsafe { getRTSStatsEnabled() };
    actual == expected
}

#[test]
#[ignore]
fn test_getRTSStatsEnabled() {
    unsafe { getRTSStatsEnabled() };
    todo!("assert")
}

#[cfg(feature = "sys")]
#[quickcheck]
fn equivalent_getAllocations() -> bool {
    let expected = unsafe { transmute(sys::getAllocations()) };
    let actual = unsafe { getAllocations() };
    actual == expected
}

#[test]
#[ignore]
fn test_getAllocations() {
    unsafe { getAllocations() };
    todo!("assert")
}

#[test]
#[ignore]
fn test_startupHaskell() {
    let argc = Default::default();
